Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_assistance_payments/residency_requirements_for_social_assistance_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Residence requirements for social assistance in Ireland
ga: Díotha cónaithe do chabhair shóisialta in Éirinn

source: The social welfare system in Ireland is divided into three main types of payments
ga: Tá an córas leasa shóisialaigh in Éirinn roinnte ina trí phríomhchinéal íocaíochtaí

source: • Social insurance payments: (for example, Jobseeker's Benefit)
ga: • Íocaíochtaí árachais shóisialaigh (mar shampla, Sochar Cuardaitheora Poist)

source: • Means-tested payments or social assistance payments: (for example, Jobseeker's Allowance)
ga: • Íocaíochtaí de réir thástáil acmhainne nó íocaíochtaí chabhair shóisialta (mar shampla, Liúntas Cuardaitheora Poist)

source: • Universal payments: (for example, Child Benefit)
ga: • Íocaíochtaí uilíocha: (mar shampla, Sochar Leanaí)

source: With all social welfare payments in Ireland, you must satisfy the rules for each scheme to qualify
ga: Le gach íocaíocht leasa shóisialaigh in Éirinn, ní mó duit na rialacha do gach ceann de na scéimeanna a shásamh le bheith ina dteideal

source: You must also be habitually resident in Ireland to qualify for the following payments:
ga: Ní mór go mbeidh gnáthchónaí ort in Éirinn chun a bheith i dteideal na n-íocaíochtaí seo a leanas:

source: • Domiciliary Care Allowance • Guardian's Payment (Non-Contributory)
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtí Shibhialta Mharthana (Neamh-Ranníocach)

source: This means that they are payable to a person who qualifies for EU migrant worker status for dependants who are resident in Ireland or in another EEA state. People who do not have to satisfy the habitual residence condition for Family Benefits include:
ga: Níl dualgas ar do chéile, páirtnéir sibhialta nó do chomhchónaitheoir agus aon leanaí cleithiúnacha atá agat coinníoll an ghnáthchónaithe a shásamh ina gceart féin

source: You can read more about Exemption from the HRC for Family Benefits on welfare.ie. People who move to Ireland to look for employment are subject to the habitual residence condition in the normal way while looking for work
ga: Mar sin, má dhéanann tú iarratas ar íocaíocht leasa shóisialaigh, níl ach ort féin, an t-iarratasóir, coinníoll an ghnáthchónaithe a shásamh

source: If you are an EEA national and can be considered an EU migrant worker, you may be entitled to Supplementary Welfare Allowance (SWA)
ga: Tá Treoirlínte Oibríocha maidir leis an gcoinníoll cónaithe rialta chuimsitheach foilsithe ag an Roinn Coimirce Sóisialaí

source: Changes to HRC in 2014
ga: Athruithe ar Choinníoll Gnáthchónaithe in 2014

source: You must be habitually resident in the State on the date you make the application and you must remain habitually resident in the State after you apply
ga: Ní mór go bhfuil gnáthchónaí ort sa Stát ar an dáta a dhéanann tú an t-iarratas agus ní mór duit fanacht agus gnáthchónaí ort sa Stát i ndiaidh duit iarratas a dhéanamh

source: This provision was added by the Social Welfare and Pensions Act 2014, which came into force on 17 July 2014
ga: Chuir an tAcht Leasa Shóisialaigh agus Pinsean, 2014, a tháinig i bhfeidhm an 17 Iúil 2014, an fhoráil seo leis

source: Before this, the habitual residence condition (HRC) could only be examined on the date of application
ga: Roimhe seo, níorbh fhéidir coinníoll an ghnáthchónaithe (CGC) a scrúdú ach ar dháta an iarratais

source: Since 17 July 2014, the HRC decision on your case may be reviewed if any relevant circumstances change (for example, if you lose the right to reside) or if you were absent from the State for a significant period of time
ga: Ón 17 Iúil 2014 i leith, féadtar athbhreithniú a dhéanamh ar an gcinneadh CGC ar do chás má thagann athrú ar aon chúinsí ábhartha (mar shampla, mura mbíonn an ceart a thuilleadh agat chun cónaí sa Stát) nó má bhí tú i do chónaí amuigh ón Stát ar feadh tréimhse shuntasach ama

source: What is habitual residence?
ga: Céard is cónaí rialta ann?

source: The term "habitually resident" is not defined in Irish law
ga: Níl an téarma “cónaí rialta” sainithe i ndlí na hÉireann

source: In practice it means that you have a proven close link to Ireland
ga: I gcleachtas, is éard is brí leis ná go bhfuil garnasc profa agat le hÉirinn

source: The term also conveys permanence - that a person has been here for some time and intends to stay here for the foreseeable future
ga: Léiríonn an téarma marthanaí freisin – go bhfuil duine anseo ar feadh tréimhse fada agus go bhfuil sé i gceist acu fanacht anseo ar feadh tréimhse amach anseo

source: Proving you are habitually resident relies heavily on fact
ga: Le cruthú go bhfuil cónaí rialta anseo, teastaíonn fianaise uait

source: If you have lived in Ireland all your life, you will probably have no difficulty showing that you satisfy the factors which indicate habitual residence – see list below
ga: Má tá cónaí ort in Éirinn do do shaol uile, an-seans nach mbeidh mórán deacrachta agat a léiriú go sásaíonn na fachtóir a thugann cónaí rialta le fios - féach ar an liosta thíos

source: Who decides whether an applicant is habitually resident?
ga: Cé a dhéanann an cinneadh más cónaitheoir rialta é/í an t-iarratasóir nó nach bhfuil?

source: Statutorily appointed Deciding Officers (or Determining Officers in the case of Supplementary Welfare Allowance) determine whether you meet the requirement to be habitually resident in the State
ga: Cinneann Oifigí Cinnte atá ceaptha go reachtúil (nó Oifigí Cinnte sa chás go bhfuil Liúntas Leasa Shóisialaigh Bhreise i gceist) má chomhlíonann tú an díth le bheith i do chónaitheoir rialta sa Stát

source: The Officer will rely on the evidence you provide and be guided by national and EU law and guidelines when making their decision
ga: Braithfidh an tOifigeach ar fhianaise a sholáthraíonn tú agus beidh sé/sí treoraithe ag dlí agus treoirlínte náisiúnta agus AE agus an cinneadh á dhéanamh acu

source: When the Officer makes a decision on whether a person is habitually resident they must follow a series of steps:
ga: Nuair a dhéanann Oifigeach cinneadh má tá duine ina c(h)ónaitheoir rialta nó nach bhfuil ní mór dóibh sraith céimeanna a leanúint:

source: Check whether you are a person who is not regarded as being habitually resident in the State
ga: Seiceáil más duine nach bhfuil ceaptha mar chónaitheoir rialta sa Stát thú

source: For example, asylum seekers are not regarded as habitually resident
ga: Mar shampla, ní mheastar go bhfuil iarratasóirí ar thearmann ina gcónaitheoirí rialta

source: You can find out more about who is not regarded as habitually resident in Appendix 3 of the Operational Guidelines
ga: Is féidir leat tuilleadh a fháil amach maidir le cé nach gcaitear leo mar chónaitheoirí rialta in Aguisín 3 de na Treoirlínte Oibríocha

source: Check whether you are exempt from the habitual residence condition
ga: Seiceáil má tá tú díolmhaithe ón gcoinníoll cónaithe rialta

source: Certain people, in particular EEA nationals who are considered migrant workers, are exempt from the habitual residence condition (see also Exemption from the habitual residence condition above)
ga: Tá daoine áirithe, go háirithe daoine atá ina saoránaigh EEA agus a chaitear leo mar oibrí imirceach, díolmhaithe ón gcoinníoll cónaithe rialta (féach freisin Díolmhaithe ón gcoinníoll cónaithe rialta do shaoránaigh EEA thíos)

source: You can find out more about who is exempt from the habitual residence condition in Section 3 of the Operational Guidelines
ga: Is féidir leat tuilleadh eolais a fháil maidir le cé atá díolmhaithe ón gcoinníoll cónaithe rialta i Roinn 3 de na Treoirlínte Oibríocha

source: Check whether a previous habitual residence decision has been given or if the case is under appeal
ga: Seiceáil ar rinneadh cinneadh cónaithe rialta cheana nó an bhfuil na cás faoi achomharc

source: A previous decision on habitual residence should carry through to subsequent claims unless there has been a significant change in circumstances since a new application was made
ga: Ba cheart go leanfaidh cinneadh a rinneadh cheana ar chónaí rialta ar aghaidh go héilimh iartheachtacha ach amháin más rud é go raibh athrú ollmhór i gcúinsí an iarratasóra ón uair a rinneadh iarratas nua

source: Consider whether the person has a right to reside in the State
ga: Breithnigh má tá an ceart ag duine cur fúthu sa Stát

source: If you do not have a legal right of residence in this State, you will not be regarded as habitually resident
ga: Mura bhfuil ceart dlí agat cónaí a bheith agat sa Stát seo, ní chaithfear leat mar dhuine a bhfuil cónaí rialta acu

source: The following groups of people have a right to reside in Ireland:
ga: Tá an ceart ag na grúpaí daoine seo a leanas maireachtáil in Éirinn:

source: • UK nationals from the Common Travel Area (CTA)
ga: • Saoránaigh an RA ón Limistéar Taistil Chomónta (CTA)

source: • EEA nationals who are employed or self-employed in Ireland
ga: • Saoránaigh an EEA atá fostaithe nó féinfhostaithe in Éirinn

source: • EEA nationals who have been employed here for over a year and are now unemployed, provided they are registered as jobseekers with the Department of Social Protection
ga: • Saoránaigh an EEA atá tar éis a bheith fostaithe anseo ar feadh níos mó ná bliain agus atá dífhostaithe anois, chomh fada agus atá siad cláraithe mar chuardaitheoirí poist leis an Roinn Coimirce Sóisialaí,

source: • EEA nationals, who have been employed here for less than a year and are now unemployed, may stay for another 6 months provided they are registered as jobseekers with the Department of Social Protection
ga: • Saoránaigh an EEA atá tar éis a bheith fostaithe anseo ar feadh níos lú ná bliain agus atá dífhostaithe anois, is féidir leo fanacht anseo ar feadh 6 mhí chomh fada agus atá siad cláraithe mar chuardaitheoirí poist leis an Roinn Coimirce Sóisialaí

source: • EEA nationals who can support themselves, their spouse/civil partner and any accompanying dependents and who have comprehensive sickness insurance
ga: • Saoránaigh EEA atá in ann tacú leo féin, lena c(h)éile/p(h)áirtí sibhialta agus le haon duine eile atá ag brath orthu agus le hárachas breoiteachta cuimsithí

source: • EEA nationals who are visitors or jobseekers can stay for up to 3 months provided that they do not become a burden on the social welfare system of the State during that period (as determined by the Department of Justice - SI 656 of 2006 (pdf))
ga: • Is féidir le saoránaigh an EEA atá ina gcuairteoirí nó ina gcuardaitheoirí poist fanacht ar feadh suas go 3 mhí chomh fada agus nach dtarlaíonn sé go bhfuil siad ina n-ualach ar chóras leasa shóisialaigh an Stáit taobh istigh den tréimhse sin

source: • Non-EEA nationals with an employment permit that allows them to legally reside and work in the State
ga: • Náisiúnaigh Neamh-LEE a bhfuil cónaithaitheacht nó ceadfostaíochta acu a ligeann dóibh cónaí agus oibriú go dleathach sa Stát

source: A person with permission to reside will have the appropriate immigration stamp in their passport and a Certificate of Registration issued by the Garda National Immigration Bureau (GNIB) (a GNIB card)
ga: Beidh ag duine a bhfuil cead cónaithe acu an stampa oiriúnach inimirce ina bpas agus Deimhniú Cláraithe arna eisiúint Biúró Náisiúnta an Gharda Síochána um Inimirce (GNIB) (cárta GNIB)

source: • Asylum seekers who have been granted permission to remain
ga: • Iarrthóirí tearmainn ar tugadh cead dóibh chun fanacht sa tír

source: The resident spouse or civil partner and/or dependants of a person with refugee status or of a non-EEA national with an employment permit normally hold the same habitual residence status as that of the sponsor
ga: Is gnách go mbíonn an stádas céanna cónaitheachta ag céile nó páirtnéir sibhialta cónaithe agus/nó cleithiúnaithe de dhuine ag a bhfuil stádas dídeanaí nó náisiúnaigh Neamh-LEE ag a bhfuil cead fostaíochta agus an stádas sin a bhíonn ag an urraitheoir

source: These family members should be treated as habitually resident as long as they and the sponsor retain permission to be in the State
ga: Ba cheart caitheamh leis na daoine muinteartha seo amhail gnáthchónaí bheith orthu a fhad agus a choimeádann siad féin agus an t-urraitehoir cead chun bheith sa Stát

source: Examine the 5 factors to determine habitual residence
ga: Scrúdaigh na 5 fhachtóir chun cónaí rialta a chinneadh

source: Once your right to reside has been established the following 5 factors (which have been set down in Irish and European law) are examined to find out if you are habitually resident in Ireland:
ga: Nuair atá do cheart cónaithe bunaithe, scrúdaítear na 5 fhachtóir seo a leanas (atá tar éis a bheith leagtha síos i ndlí na hÉireann agus na hEorpa) d’fhonn a fháil amach má tá cónaí rialta ort in Éirinn nó mura bhfuil:

source: • Length and continuity of residence in Ireland
ga: • Fad agus leanúnachas an chónaithe in Éirinn

source: • Length and purpose of any absence from Ireland
ga: • Fad agus cuspóir aon easpa ó Éire

source: • Nature and pattern of employment
ga: • Nádúr agus patrún fostaíochta

source: • Your future intentions to live in Ireland as it appears from the evidence
ga: • Do bharaí amach anseo chun cónaithe in Éirinn de réir mar atá le feiceáil ón bhfianaise

source: You can find out more about the 5 factors in the Operational Guidelines on the Department of Social Protection's website
ga: Is féidir leat tuilleadh a fháil amach faoin 5 fhachtóir sna Treoirlínte Oibríocha ar shuíomh gréasáin an Roinne Coimirce Sóisialaí

source: The Department of Social Protection has also published a supplement to the Guidelines with scenarios which show how the habitual residence condition is applied in practice
ga: Ciallaíonn sé seo go bhfuil siad iníoctha do dhuine a cháilíonn do stádas oibrí imircigh an AE do chleithiúnaí atá ina gcónaí in Éirinn nó i stát EEA eile

source: EU rules prevent discrimination on nationality grounds in relation to social security, so it is not possible to exempt a particular category of Irish citizens (such as returning Irish emigrants) from the habitual residence condition (either in general or for Carer’s Allowance) without extending the same treatment to all EU nationals
ga: Coisceann rialacha an AE idirdhealú ar bhonn náisiúntachta maidir le tacaíocht shóisialta, mar sin níl an fhéidearthacht ann catagóir áitithe de shaoránaigh na hÉireann (imircí ag filleadh ar Éire, mar shampla) a rangú mar dhíolmhaithe ón gcoinníoll cónaithe rialta (go ginearálta nó do Liúntas Cúramóra) gan caitheamh le gach saoránach de chuid an AE mar a chéile

source: However, the guidelines on determination of habitual residence address the issue of returning emigrants very specifically
ga: Ach, pléann na treoirlínte maidir le cinneadh a dhéanamh ar chónaí rialta an cheist i leith imircí ag filleadh go han-chuimsitheach

source: The guidelines state: “A person who had previously been habitually resident in the State and who moved to live and work in another country and then resumes his/her long-term residence in the State may be regarded as being habitually resident immediately on his/her return to the State.”
ga: Tá an mhéid seo a leanas ráite sna treoirlínte: “D’fhéadfadh sé go gcaithfear le duine a raibh cónaí rialta aige/aici sa Stát cheana agus a bhog chun dul ag obair i dtír eile agus ansin a thógann suas a c(h)ónaí fadtéarmach sa Stát arís mar dhuine lena bhfuil cónaí rialta aige/aici díreach tar éis dó/di filleadh ar an Stát."

source: When determining the main centre of interest for returning emigrants, Deciding Officers take account of:
ga: Agus cinneadh á dhéanamh ar an bpríomhshuim atá ag imircí ag filleadh, tógann Oifigigh Cinnte na rudaí seo a leanas san áireamh:

source: • The purpose of your return, for example, because your foreign residence permit has expired
ga: • An fáth a bhfuil tú ag filleadh, mar shampla, mar gur éag do chead cónaithe eachtartha

source: • Verified arrangements which you have made in regard to returning on a long-term basis, for example, transfer of financial accounts and any other assets, termination of residence-based entitlements in the other country, or assistance from Safe-Home or a similar programme to enable Irish emigrants to return permanently
ga: • Socruithe fíoraithe atá déanta agat maidir le filleadh ar bhonn fadtéarmaigh, mar shampla, aistriú cuntas airgeadais agus aon mhaoin eile, deireadh a chur le teidlíochtaí atá ag daoine atá ina gcónaí thar lear sa tír eile, nó cúnamh ó Safe-Home nó clár cosúil leis chun cuidiú le himircí na hÉireann filleadh go buan

source: • Length and continuity of your previous residence in the State
ga: • Fad agus leanúnachas do chónaí sa Stát cheana

source: • Your record of employment or self employment in another state and
ga: • Do thaifead fostaíochta nó féinfhostaíocht i stát eile agus

source: • Whether you have maintained links with your previous residence and can be regarded as resuming your previous residence rather than starting a new period of residence
ga: • Más rud é gur choinnigh tú do naisc leis an gcónaí a bhí agat cheana agus más féidir caitheamh leat mar dhuine atá ag athchromadh an chónaithe a bhí agat cheana ina ionad tús a chur le ceann nua

source: If the DSP needs more information to decide whether you are habitually resident in the Republic of Ireland you may be asked to fill out the HRC1 form (pdf)
ga: Má theastaíonn breis faisnéise ón RCS chun cinneadh a dhéanamh ar cibé acu an bhfuil nó nach bhfuil gnáthchónaí ort i bPoblacht na hÉireann, féadtar iarraidh ort foirm HRC1 (pdf) a chomhlánú

source: Regardless of what country you are coming from you may be asked to provide documentary evidence that shows your 'centre of interest' is now in Ireland
ga: Is ainneoin an tír as a bhfuil tú ag filleadh ó d’fhéadfadh sé go mbeidh ort fianaise cáipéisíochta a sholáthar a léiríonn céard é do 'spéis' anois in Éirinn

source: This evidence should show that you have moved to Ireland, you intend to settle in Ireland permanently and you do not intend to go back to live in the country you came from
ga: Ba cheart go léireodh an fhianaise seo gur bhog tú go hÉirinn, go bhfuil sé i gceist agat fanacht in Éirinn go buan agus nach bhfuil sé i gceist agat filleadh chun cónaithe sa tír as a dtáinig tú

source: Where possible, you should provide the following documentary evidence:
ga: Nuair atá an fhéidearthacht ann, ba cheart duit an fhianaise cáipéisíochta seo a leanas a sholáthar:

source: • Proof to show you have given up accommodation abroad
ga: • Fianaise a thaispeánann gur thug tú suas aon lóistín a bhí agat thar leat

source: • Proof that you have cancelled or applied to cancel any non-transferable benefits
ga: • Fianaise a thaispeánann gur cheallaigh tú nó go ndearna tú iarratas aon shochar neamh-aistrithe a chur ar ceal

source: • Proof you have transferred or applied to transfer any transferable income
ga: • Fianaise gur aistrigh tú nó go ndearna tú iarratas aon ioncam inaistrithe a aistriú

source: • Proof to show measures you have put in place to open a bank account here
ga: • Fianaise de na miosúir atá curtha i ngníomh agat chun cuntas bainc a oscailt anseo

source: • Proof to show you have a tenancy in your own name (in Ireland)
ga: • Fianaise chun a léiriú go bhfuil tionóntacht agat i d’ainm féin (in Éirinn)

source: • Proof of travel documents including, where relevant, excess baggage fees and removal/shipping receipts
ga: • Fianaise na gcáipéisí taistil agat lena n-áirítear, más ann dóibh, bagáiste breise agus admhálacha seoladóireachta

source: All evidence presented will be authenticated, as far as is possible, by the relevant Officer
ga: Déanfaidh an tOifigeach cuí an fhianaise a chuirtear os a c(h)omhair a fhordheimhniú, chomh fada agus is féidir

source: In some cases you may be asked to submit further documentary evidence
ga: I gcásanna áirithe, d’fhéadfadh sé go gcuirfear ceist ort fianaise cáipéisíochta breise a chur isteach

source: In certain cases, a Social Welfare Inspector may investigate your application
ga: I gcásanna áirithe, d’fhéadfadh Cigire Leasa Shóisialaigh imscrúdú a dhéanamh ar d’iarratas

source: Appealing a decision on habitual residency
ga: Ag cur isteach achomharc ar chinneadh maidir le cónaí rialta

source: If you are not satisfied with the decision made in your case you have the right of review and/or the right of appeal
ga: Mura bhfuil tú sásta le cinneadh Oifigeach Cinntí nó tá sé de cheart agat iarratas a dhéanamh ar athbhreithniú agus/nó ceart achomhairc

source: If you wish to have your case reviewed you can submit additional evidence and ask for the decision to be reviewed
ga: Má dhéantar athbhreithniú ar do chás, is féidir leat fianaise bhreise a chur isteach agus iarradh ar athbhreithniú ar an gcinneadh

source: You can also bring an appeal against the decision to the independent Social Welfare Appeals Office
ga: Is féidir leat achomharc a thógáil i gcoinne an chinnidh chuig an Oifig Achomhairc Leasa Shóisialaigh neamhspleách

source: If you prefer, you may appeal directly to the independent Social Welfare Appeals Office without first asking for a review
ga: Más fearr leat, féadfaidh tú achomharc a dhéanamh go díreach chuig an Oifig Achomhairc Leasa Shóisialaigh neamhspleách gan athbhreithniú a lorg i dtosach
